app/controllers/ng_rubies_controller.rb

SELECT `ng_rubies`.* FROM `ng_rubies`
---
  def index
    @ng_rubies = NgRuby.all

INSERT INTO `ng_rubies` (`name`, `created_at`, `updated_at`) VALUES ('test', '2015-03-26 17:28:27.658627', '2015-03-26 17:28:27.658627')
---
  def create
    @ng_ruby = NgRuby.new(ng_ruby_params)

    respond_to do |format|
      if @ng_ruby.save

UPDATE `ng_rubies` SET `name` = 'test2', `updated_at` = '2015-03-26 17:28:32.392837' WHERE `ng_rubies`.`id` = 1
---
  def update
    respond_to do |format|
      if @ng_ruby.update(ng_ruby_params)

SELECT  `ng_rubies`.* FROM `ng_rubies` WHERE `ng_rubies`.`id` = 1 LIMIT 1
---
    def set_ng_ruby
      @ng_ruby = NgRuby.find(params[:id])