app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('tony', 'tony123@yahoo.com', '2015-03-19 21:23:03.521296', '2015-03-19 21:23:03.521296')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `name` = 'tonytest', `updated_at` = '2015-03-19 21:23:11.017894' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)